4285f4/M5DualKey-UserDemo/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_RTC_CLK_SRC_EXT_CRYS=y
CONFIG_RTC_CLK_CAL_CYCLES=1024
CONFIG_ESP_PHY_RF_CAL_NONE=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# --- 临时诊断（定位 BLE 档功耗用，定位完成后应移除）--------------------------
# PM_PROFILING 让 esp_pm_dump_locks 打印每把锁的持有次数/时长，以及各电源模式
# 的时间占比；ESP_TIMER_PROFILING 让 esp_timer_dump 打印定时器名字与触发次数。
# 这两项是唯一能回答"CPU 到底降频了没有 / 谁在挡 / 谁在周期唤醒"的手段，
# 开销很小（PM_PROFILING 只在锁 acquire/release 时取时间戳）。
# 观测通道见 main/diag_power.c：BLE 档采样落 NVS，切 WiFi 档后 GET /diag 读回。
CONFIG_PM_PROFILING=y
CONFIG_ESP_TIMER_PROFILING=y

# --- 功耗优化：BLE 控制器 modem sleep（BLE 档静置电流的主开关）---------------
# 开启后控制器在两次 BLE 事件之间休眠，仅靠低功耗时钟维持蓝牙基准时钟；
# 关闭时射频前端与 PLL 全程带电（实测静置 66~95mA，正常 BLE HID 应 2~4mA）。
# 更关键的是，这个宏在 ESP32-S3 上同时控制三件事（源码：components/bt/
# controller/esp32c3/bt.c —— 注意 esp32s3/Kconfig.in 只是 source 它，
# controller/esp32/bt.c 是初代 ESP32 双模控制器，S3 不编译）：
#   ① bt.c:2097  s_lp_cntl.enable = (sleep_mode == ESP_BT_SLEEP_MODE_1)
#                -> 为真才调 btdm_controller_enable_sleep(true)，即射频入睡开关；
#   ② bt.c:1740  sleep_mode != MODE_1 时置 s_lp_cntl.no_light_sleep = 1，
#                bt.c:1774 据此创建名为 "btLS" 的 ESP_PM_NO_LIGHT_SLEEP 锁；
#   ③ bt.c:1781  无条件创建 "bt" APB_FREQ_MAX 锁，而 pm_impl.c:554 规定持有
#                APB_FREQ_MAX 时最低只能到 PM_MODE_APB_MAX、进不了 light sleep。
#                这把锁只在 MODE_1 分支里释放（bt.c:1200），唤醒时重取（:1215）。
# => 不配 MODE_1，前两层漏电都无解；配了则三件事一起解决。
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
# 低功耗时钟用板载 32.768kHz 晶振（RTC_CLK_SRC_EXT_CRYS 已启用）。
# 注意：bt.c:1715 会在启动时用 rtc_clk_slow_src_get() 实测确认晶振真的存在，
# 探测不到就回退主晶振并打 warning。S3 上回退本身不会禁用 light sleep
# （禁用只在 bt.c:1720 的 !MAIN_XTAL_PU_DURING_LIGHT_SLEEP 条件下发生）。
CONFIG_BT_CTRL_LPCLK_SEL_EXT_32K_XTAL=y
# 32.768kHz 晶振缺失时的兜底：light sleep 期间保持主晶振供电，避免蓝牙失去
# 基准时钟。晶振存在时该选项不生效，因此不增加静态功耗（见 Kconfig help）。
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y

# --- 功耗优化：USB Serial/JTAG 与自动 light sleep 共存 ------------------------
# ESP32-S3 的 USB-Serial-JTAG 无法在 light sleep 下工作。不开此项时，一旦
# esp_pm_configure(light_sleep_enable=true)，串口日志与烧录通道会在插线状态下
# 失效（且 USB SOF 监测只容忍 3ms 的休眠间隙）。
# 开启后：插着 USB 时内部持有 NO_LIGHT_SLEEP 锁 -> 日志/烧录照常；
# 拔线走电池后才真正进入 light sleep（省电目标场景）。
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8196
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8196
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8196
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=2000
CONFIG_BUTTON_LONG_PRESS_HOLD_SERIAL_TIME_MS=300
CONFIG_MATRIX_COLS=2
CONFIG_MATRIX_LED_COUNT=2
CONFIG_ENABLE_RGB_MATRIX_TYPING_HEATMAP=y
